---
kind: type
id: T:Autodesk.Revit.UI.Macros.UIDocumentMacroOptions
source: html/58b01732-d76b-ea31-8dd6-a2da7c90106d.htm
---
# Autodesk.Revit.UI.Macros.UIDocumentMacroOptions

The document macro options.

## Syntax (C#)
```csharp
public enum UIDocumentMacroOptions
```